{ 
  "rooms": [
    {
      "name": "Enviro-Field",
      "description": "This selection vaporizes the player instantly. Game Over.",
      "items": [],
      "pointsOfInterest": [],
      "exits": {
        "west": "Docking Bay",
        "north": "",
        "south": "",
        "east": ""
      }
    },
    {
      "name": "Docking Bay",
      "description": "You glance around the Docking Bay. It acts as a structure jutting from the starboard side of the ship, providing room for landing and loading. \nThe vast port your ship entered through generates a crackling enviro-field, holding in what little toxic atmosphere that remains. \nYou cannot make out any more details due to the dim emergency lighting. \n\n- To the West, you see the bay doors exit.",
      "items": [
        {
          "name": "scrambler",
          "fullName": "a Mk39 Broad-Band Scrambler/Unscrambler",
          "isHeld": true
        },
        {
          "name": "ship",
          "fullName": "the E.D.F.S. Spartan",
          "isHeld": false
        }
      ],
      "pointsOfInterest": [
        {
          "name": "scrambler",
          "description": "The mk39 high-band frequency scrambler/unscrambler. AKA 'The Garage Door Opener.' \nMakes quick work of electronically locked doors.",
          "used": false,
          "usedDescr": ""
        },
        {
          "name": "ship",
          "description": "The E.D.F.S. Spartan rests precariously on its twisted landing struts. Every few seconds her hull groans as Zhang shifts his weight inside. \nShe's seen better days, but you're still breathing. \n\nYou silently mouth words of appreciation.",
          "used": false,
          "usedDescr": ""
        }
      ],
      "exits": {
        "west": "Junction Hallway 1",
        "north": "",
        "south": "",
        "east": "Enviro-Field"
      }
    },
    {
      "name": "Junction Hallway 1",
      "description": "This hallway divides the ship into the stern and bow sectors. An environ-panel hangs open, the oxygen pipe here has been siphoned. \nThe dim red light pervades this area, too, allowing you to barely make out the signage off 3 exits. \nIt seems dumb for everything to be labeled grey, how frustrating. \n\n- To the North, you spot a grey stripe labeled with \"Crew Bays\" leading to the door. \n- To the South, you spot another grey stripe, this one doubled, labeled \"Cargo/Engineering Sector\". \n- To the East, you spot a final grey stripe on the open bay doors, you can vaguely make out the silhouette of your ship in the distance.",
      "items": [
        {
          "name": "pipes",
          "fullName": "a panel containing a section of the ship's Atmo-Ducts, maybe there's breathable air inside",
          "isHeld": false
        }
      ],
      "pointsOfInterest": [
        {
          "name": "pipes",
          "description": "Atmo-ducting. This heap isn't producing atmosphere anymore, but if you bleed the lines a bit with your suit you might be able to \nsiphon off some nearby gases in them.",
          "used": false,
          "usedDescr": "Atmo-ducting. You've siphoned off what you could from here, already."
        }
      ],
      "exits": {
        "east": "Docking Bay",
        "north": "Junction Hallway 2",
        "south": "Cargo Hold",
        "west": ""
      }
    }
  ]
}