[
  {
    "name": "Enviro-Field",
    "description": "As you enter the room, your body starts to disintegrate...",
    "exits": {
      "west": "Docking Bay"
    }
  },
  {
    "name": "Docking Bay",
    "description": "You glance around the Docking Bay. It acts as a structure jutting from the starboard side of the ship, providing room for landing and loading. \nThe vast port your ship entered through generates a crackling enviro-field, holding in what little toxic atmosphere that remains. \nYou cannot make out any more details due to the dim emergency lighting. \n\n- To the West, you see the bay doors exit.",
    "exits": {
      "west": "Junction Hallway 1",
      "east": "Enviro-Field"
    },
    "interactables": [
      "ship"
    ]
  },
  {
    "name": "Junction Hallway 1",
    "description": "This hallway divides the ship into the stern and bow sectors. An environ-panel hangs open, the oxygen pipe here has been siphoned. \nThe dim red light pervades this area, too, allowing you to barely make out the signage off 3 exits. \nIt seems dumb for everything to be labeled grey, how frustrating. \n\n- To the North, you spot a grey stripe labeled with \"Crew Bays\" leading to the door. \n- To the South, you spot another grey stripe, this one doubled, labeled \"Cargo/Engineering Sector\". \n- To the East, you spot a final grey stripe on the open bay doors, you can vaguely make out the silhouette of your ship in the distance.",
    "exits": {
      "east": "Docking Bay",
      "north": "Junction Hallway 2",
      "south": "Cargo Hold"
    },
    "interactables": [
      "pipes"
    ]
  },
  {
    "name": "Cargo Hold",
    "description": "You enter the Cargo Hold. Immediately the towering rows of crates, equipment, and who knows what else cast great shadows, \nblocking the dim emergency lighting overhead. You won't be able to see anything clearly without the ship's proper warehouse lighting.\n\n- To the North, you make out the grey stripe leading back to the door to the junction hallway.\n- To the South, you barely spot the grey stripe leading to a door marked \"Reactor Room\"\n",
    "exits": {
      "north": "Junction Hallway 1",
      "south": "Reactor Hallway"
    },
    "interactables": [
      "cabinet"
    ]
  },
  {
    "name": "Reactor Hallway",
    "description": "The hall before the Reactor Room is dim red, a low hum pulses from another door marked \"Power Supplies\".\n\n- To the North, you see the door to the Cargo Hold. \n- To the South, you spot the door to the Reactor Room. \n- To the East, a door marked \"Power Supplies\" hums with the sound of machinery.\n",
    "exits": {
      "north": "Cargo Hold",
      "south": "Reactor Room",
      "east": "Power Supplies"
    }
  },
  {
    "name": "Reactor Room",
    "description": "The Reactor Room vibrates with the steady hum of the emergency generators coming through the adjoining wall.\nA long console sits against the far wall, its displays dimmed out. Seems like it’s in power savings mode.\n\n- To the North, you see the door back to the Reactor Hallway. \n- To the South, the door to \"Engine Room\" sits darkened.",
    "exits": {
      "north": "Reactor Hallway",
      "south": "Engine Room Hallway"
    },
    "interactables": [
      "console"
    ]
  },
  {
    "name": "Engine Room Hallway",
    "description": "The air in the hall before the Engine Room holds the tang of burning oil, even without the Chief's expertise you can see several clear signs of mechanical neglect. \n\nWhat happened to the crew to allow things to reach this state?\n\n- To the East, you spot the door to the Engine Room. \n- To the North, the Reactor Room.\n",
    "exits": {
      "north": "Reactor Room",
      "east": "Engine Room"
    },
    "interactables": [
      "pipes"
    ]
  },
  {
    "name": "Engine Room",
    "description": "The Engine Room is not so much a \"room\" as it is an observation platform now containing a messy makeshift workshop.\nRows of engine parts from ships of every capacity line the shelves and hang partially completed from shop chains.\nA rickety steel railing separates you from the yawning cavern that holds the freighter's industrial capacity jump drives.\n\n- To the West, you see the door returning to the hallway.\n- To the North, you see the doors to the Power Supplies are now working.",
    "exits": {
      "west": "Engine Room Hallway",
      "north": "Power Supplies"
    },
    "interactables": [
      "rack"
    ]
  },
  {
    "name": "Power Supplies",
    "description": "Rows of silent reactor equipment are stained with a layer of dust and grease.\nIn the far corner of the area, an emergency generator glows white hot, the air distorted around it.\nIt's only a matter of time before its core melts down, good thing you're planning on leaving soon!\n\n- To the West, you see the door returning to the hallway.\n- To the South, you see the electronic doors to the Engine Room.",
    "exits": {
      "west": "Reactor Hallway",
      "south": "Engine Room"
    },
    "interactables": [
      "poster"
    ]
  },
  {
    "name": "Junction Hallway 2",
    "description": "This hallway seems to lead to the crew quarters and command deck at the bow of the ship. \n\n- To the North, you see the doors to the Command Deck.\n- To the South, you see the door returning to Junction Hallway 1.\n- To the West, you see a door that looks damaged.",
    "exits": {
      "west": "Sketchy Room",
      "north": "Command Deck Hallway",
      "south": "Junction Hallway 1"
    }
  },
  {
    "name": "Sketchy Room",
    "description": "You enter what looks to have once been a mess hall. Now it's just a mess. The smell of death and decay lingers in the air.\nYou notice unorganized stacks of cages, filled with various decomposing creatures. You check a nearby manifest tablet.\nIt seems they were smuggling some extremely rare species and then abandoned them here for some reason...but why?\nAs if in answer to your question, you notice the largest cage empty with its bars twisted violently outward.\n\n- To the East, you see the door returning to the hallway,\n  it appears as if something has been pounding on it to get out...",
    "exits": {
      "east": "Junction Hallway 2"
    }
  },
  {
    "name": "Command Deck Hallway",
    "description": "The Command Deck is comprised of the obvious Bridge and Cockpit, but on a ship of this class also features the crew quarters and Medical Bay. \n\n- To the North, you see the security doors leading to the Bridge.\n- To the South, you see the door returning to the hallway.\n- To the East, you see the door to the MedBay.\n- To the West, you see the door to their Crew Quarters.",
    "exits": {
      "west": "Crew Quarters",
      "north": "Bridge",
      "south": "Junction Hallway 2",
      "east": "MedBay"
    }
  },
  {
    "name": "Crew Quarters",
    "description": "The crew's living quarters are a hodgepodge of about a dozen or so sleeping areas haphazardly arranged.\nYou see only 5 official LOCKERs though, meaning the original crew must have been much smaller... \n\n- To the East, you see the door returning to the hallway.",
    "exits": {
      "east": "Command Deck Hallway"
    },
    "interactables": [
      "locker"
    ]
  },
  {
    "name": "MedBay",
    "description": "You enter the fluorescent lighting of the MedBay and immediately notice three patient beds surrounded by medical equipment.\nAll of them are covered with various blood stains. The blood is browning and no longer tacky, these stains are not fresh.\nRunning along the length of the wall is a mortuary COOLER.\n\n- To the West, you see the door leading back to the Command Deck Hallway.",
    "exits": {
      "west": "Command Deck Hallway"
    },
    "interactables": [
      "cooler"
    ]
  },
  {
    "name": "Bridge",
    "description": "The Bridge is in disarray. It looks like several small skirmishes broke out in here, \nblaster fire pocks the plasti-steel bulkheads of the walls and ceiling and long splashes of gore lie splattered here and there.\nA large AIRLOCK used for boarding sits secured on the far wall.\n\n- To the North, you see the doors to the Cockpit.\n- To the South, you see the door returning to hallway.",
    "exits": {
      "north": "Cockpit",
      "south": "Command Deck Hallway"
    },
    "interactables": [
      "airlock"
    ],
    "entryItem": "keycard"
  },
  {
    "name": "Cockpit",
    "description": "The controls to a starship of this size are mainly meant for monitoring the ship's auto-pilot as it conducts its routines.\nThus, the room features more display screens and readouts rather than any sort of traditional manual controls.\n\n- To the South, you see the door returning to the Bridge.",
    "exits": {
      "south": "Bridge"
    },
    "interactables": [
      "library",
      "pipes"
    ]
  }
]
